[
    {
        "author": "Eileen Costello", 
        "collector": "Eileen Costello", 
        "decade": "1920s", 
        "geolocation": {
            "lat": [
                53.51798789999999, 
                53.93458099999999
            ], 
            "placename": [
                "Tuam", 
                "Mayo"
            ], 
            "lng": [
                -8.855627499999969, 
                -9.351645599999983
            ]
        }, 
        "itma_collection_id": "amhrain_mhuighe_seola", 
        "itma_pub_order": 12, 
        "name": [
            "Eileen Costello", 
            "Eibhlín Bean Mhic Choisdealbha"
        ], 
        "people": [
            "Eileen Costello", 
            "Eibhlín Bean Mhic Choisdealbha"
        ], 
        "publication_date": "1923", 
        "publication_details": "Dublin : The Talbot Press, 1923", 
        "text": [
            "Amhráin Mhuighe Seóla is a classic collection of traditional songs in the Irish language, one of the relatively few to contain notated melodies as well as words.", 
            "These songs were collected in Co Galway and Co Mayo by Mrs Eileen Costello (Eibhlín Bean Mhic Choisdealbha) of Tuam in the early 20th century, and were published by the Irish Folk Song Society in London in 1919 as a number of its journal, and again in Dublin in 1923 by The Talbot Press, commercial publishers. On a variety of themes, they are mainly love songs. Maigh Seola is an ancient territory between Loughrea and Headford in Co Galway.", 
            "Mrs Costello was born Edith Drury in 1870 in St Pancras workhouse in London, where her Limerick father worked as an attendant. Her mother was Welsh. She became a teacher, and was in the 1890s prominent in a number of the then many Irish cultural organisations in London. A highly active member of the Gaelic League from its London foundation in 1896, she learned Irish there. Her song collecting in the Irish language began in London (she first collected 'Neillí Bhán' on a train coming from Woolwich), but her collecting work really began in Ireland, in Tuam, where she came to live having in 1903 married a Dr Thomas Bodkin from the town. He was a medical doctor, historian, and fellow Gaelic Leaguer. Among her chief singers from 1904 was a Maggie Hession of Belclare, members of whose family are still involved in traditional music. Mrs Costello was active in the War of Independence and became a senator in the Irish Free State. She died in 1962. Although she supplied extensive source-notes to the songs and information on their backgrounds (with English translations mainly by others), her motivation was not academic. She intended her volume primarily 'for popular use in the schools and Gaelic League classes of Connacht'.", 
            "Amhráin Mhuighe Seóla, which had become a rare antiquarian volume, has been republished several times in paperback facsimile since 1990 by Cló Iar-Chonnachta. A more extensive biography of its compiler as 'Costello, Eileen' will be found at www.ainm.ie."
        ], 
        "title": "Amhráin Mhuighe Seóla: traditional folk-songs from Galway and Mayo / collected and edited by Mrs. Costello",
        "short_title": "Amhráin Mhuighe Seóla",
        "keywords": "amhrain mhuighe seola eileen costello tuam galway mayo"
    }, 
    {
        "author": [
            "Hugh Shields", 
            "Lisa Shields"
        ], 
        "collector": "James Goodman", 
        "decade": "1860s", 
        "geolocation": {
            "lat": 52.12308921102577, 
            "placename": "Ventry, Co. Kerry", 
            "lng": -10.327206463232415
        }, 
        "itma_collection_id": "goodman_vol_2", 
        "itma_pub_order": 39, 
        "name": [
            "James Goodman", 
            "Hugh Shields", 
            "Lisa Shields", 
            "Nicholas Carolan"
        ], 
        "people": [
            "James Goodman", 
            "Nicholas Carolan", 
            "Hugh Shields", 
            "Lisa Shields"
        ], 
        "publication_date": "2013", 
        "publication_details": "Dublin : Irish Traditional Music Archive = Taisce Cheol Dúchais Éireann, 2013", 
        "text": "", 
        "title": "Tunes of the Munster pipers : Irish traditional music from the James Goodman manuscripts.  Volume two / edited by Hugh & Lisa Shields",
        "short_title": "Tunes of the Munster Pipers 2",
        "keywords": "canon james goodman volume 2 tunes of the munster pipers"
    }, 
    {
        "author": "Hugh Shields", 
        "collector": "James Goodman", 
        "decade": "1860s", 
        "geolocation": {
            "lat": 52.12308921102577, 
            "placename": "Ventry, Co. Kerry", 
            "lng": -10.327206463232415
        }, 
        "itma_collection_id": "goodman_vol_1", 
        "itma_pub_order": 3, 
        "name": [
            "James Goodman", 
            "Hugh Shields", 
            "Nicholas Carolan"
        ], 
        "people": [
            "James Goodman", 
            "Nicholas Carolan", 
            "Hugh Shields"
        ], 
        "publication_date": "1998", 
        "publication_details": "Dublin : Irish Traditional Music Archive = Taisce Cheol Dúchais Éireann, 1998", 
        "text": [
            "James Goodman (1828-1896) from the Dingle area of West Kerry, a Canon of the Church of Ireland, Professor of Irish in Trinity College Dublin, and an accomplished performer on the Irish or uilleann pipes, compiled a highly important manuscript collection of Irish traditional music in the 1860s. Drawn to a great extent from the oral tradition of Munster, and partly from other manuscripts and printed sources, the collection has now been published for the first time.", 
            "This first volume of over 500 song airs and dance tunes, edited by Dr Hugh Shields from the manuscripts, contains all the melodies which Goodman himself noted down from the pipers and other performers of his native province, together with an essay on his life and career based on new research. These tunes provide musicians and scholars with a unique body of Irish music from the south-west region and give unrivalled insights into the traditional music and song of Irish-speaking pre-Famine Ireland.", 
            "Dr Hugh Shields (1929-2008), Fellow Emeritus of Trinity College Dublin and former Senior Lecturer in French in the college, collected and studied traditional music from the 1950s, especially in Ireland and with particular emphasis on Ulster. He published many articles and sound recordings on the subject, and his Shamrock, Rose and Thistle: Folk Singing in North Derry (1981) and Narrative Singing in Ireland: Lays, Ballads, Come-All-Yes and Other Songs (1993) are standard works."
        ], 
        "title": "Tunes of the Munster pipers : Irish traditional music from the James Goodman manuscripts / edited by Hugh Shields",
        "short_title" : "Tunes of the Munster Pipers 1",
        "keywords": "canon james goodman volume 1 tunes of the munster pipers"
    }, 
    {
        "author": "", 
        "collector": "", 
        "decade": "1800s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "hime", 
        "itma_pub_order": 25, 
        "name": [
            "Morris/Maurice Hime"        
        ], 
        "people": [
            "Morris/Maurice Hime"        
        ], 
        "publication_date": "1804", 
        "publication_details": "Dublin : Hime's Musical Circulating Library, n.d.", 
        "text": [
            "Morris (later Maurice) Hime, a music seller, music publisher and lottery-office keeper, was active in Dublin from the 1790s to the 1810s. Of Jewish ancestry, he had first set up in the music trade about 1785 with his brother Humphrey in Liverpool. About 1791–2 he came to Dublin, and over the next three decades published sheet music and slim collections of songs, instrumental music and dance instructions from various addresses in the city centre: College Green and later Dame St, Westmoreland St and Eustace St. His speciality was the publishing of annual country-dance collections. Taking advantage of the fact that British copyright law did not at the time apply to Ireland, Hime is said to have supplied pirated copies of British publications to his brother for sale in England, and to have become wealthy as a result. He was married to Sophia Rhames, daughter of another Dublin music seller and publisher, and later lived in Roebuck in south County Dublin where he was a Church of Ireland vestry member and churchwarden in Taney. He died in early 1828.", 
            "Hime’s publications are generally of popular British and Continental music, but his collection of country dances Forty Eight Original Irish Dances Never Before Printed claims to be Irish. Some of its melodies undoubtedly are, but others – such as ‘Bobbing Joan’ and ‘Berwick Lasses’ – had been appearing in English country-dance collections from early in the eighteenth century. They would however have been long naturalised in Ireland and would have formed part of the Irish repertory at the time of their publication here. While the collection is undated, it seems to have appeared about 1795–1800, earlier than dated country-dance collections Hime published in the opening decades of the 19th century. Two editions of the collection now in the National Library of Ireland have different title-pages. Although the contents and numbering of both are the same, the first is entitled Twenty Four Original Irish Dances Never Before Printed while the second, in a larger paper format, is entitled Forty Eight etc. Probably the first version of the Irish collection did contain 24 dances, but, when it proved popular, Hime produced a second volume of 24 which recycled the original title-page until a more comprehensive one could be created.", 
            "A pdf of this book is available from the Bibliothèque National de France at http://gallica.bnf.fr/ark:/12148/btv1b90673324 .", 
            "With thanks to Lisa and Michael Shields, and to Eoin C. Bairéad."
        ], 
        "title": "Forty Eight Original Irish Dances never Before Printed with Basses for the Piano-Forte & with Proper Figures for Dancing Book 1 & 2",
        "short_title":"48 Original Irish Dances",
        "keywords": "hime maurice morris 48 original irish dances dublin"
    }, 
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1870s", 
        "geolocation": {
            "lat": 52.6680204, 
            "placename": "Limerick", 
            "lng": -8.630497500000047
        }, 
        "itma_collection_id": "pw_joyce_ancient_irish_music", 
        "itma_pub_order": 4, 
        "name": [
            "P.W. Joyce", 
            "Professor Glover"
        ], 
        "people": [
            "P.W. Joyce", 
            "Professor Glover"
        ], 
        "publication_date": "1873", 
        "publication_details": "Dublin : McGlashan and Gill, 1873", 
        "text": [
            "Ancient Irish Music includes 100 song airs, song texts in Irish and English and dance tunes that Joyce absorbed during his childhood in Glenosheen in rural Co Limerick during the years before the Great Famine, and more that he later collected there and elsewhere. The tunes were harmonised for piano by the Dublin professional musician Professor J. W. Glover. Many of the items are accompanied by his extensive annotations, as are most of the 20 pieces in Irish Music and Song, which is the first collection of Irish-language song texts in which words are underlaid to the music notation. Each item is accompanied by an English translation."
        ], 
        "title": "Ancient Irish music : comprising one hundred airs hitherto unpublished, many of the old popular songs, and several new songs / collected and edited by P.W. Joyce ; the harmonies by Professor Glover"
        ,"short_title": "Ancient Irish Music",
        "keywords": "p.w. pw joyce ancient irish musich limerick"
    }, 
    {
        "author": "A. Martin Freeman", 
        "collector": "A. Martin Freeman", 
        "decade": "1910s", 
        "geolocation": {
            "lat": 51.9454917, 
            "placename": "Ballyvourney", 
            "lng": -9.164089399999966
        }, 
        "itma_collection_id": "freeman", 
        "itma_pub_order": 38, 
        "name": "A. Martin Freeman", 
        "people": [
            "A. Martin Freeman"
        ], 
        "publication_date": "1920", 
        "publication_details": [
            "London : Folk Song Society, 1920"
        ], 
        "text": [
            "The 147 song airs, variant airs and melodic fragments presented here come from an important collection of 84 songs in Irish songs collected by the English scholar A. Martin Freeman in the Gaeltacht (Irish-speaking) area of Ballyvourney, Co Cork, in 1913 and 1914.  The melodies were carefully noted by him from singers in their homes and at social gatherings, using a tuning fork and staff notation.", 
            "The Freeman Ballyvourney collection was published by the Folk-Song Society of London from 1920 to 1921. Facsimiles of the published collection and more information about it are available at: http://www.itma.ie/digitallibrary/print-collection/songs-from-ballyvourney.", 
            "NC & JS"
        ], 
        "title": "Songs from Ballyvourney, County Cork, with Irish texts and translations. Parts I - III / collected by A. Martin Freeman and copiously annotated by the collector, L. E. Broadwood, Frank Kidson, A. G. Gilchrist and Robin Flower"
        ,"short_title" : "Songs from Ballyvourney, Co. Cork",
        "keywords": "freeman am martin songs from ballyvourney cork"
    }, 
    {
        "author": "Carl G. Hardebec", 
        "collector": "Carl G. Hardebec", 
        "decade": "1930s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "hardebeck_ceol_na_ng", 
        "itma_pub_order": 35, 
        "name": "Carl G. Hardebec", 
        "people": [
            "Carl G. Hardebec"
        ], 
        "publication_date": "1937", 
        "publication_details": [
            "Baile Átha Cliath [Dublin] : Brún agus Ó Nualláin [Browne and Nolan], 1937"
        ], 
        "text": [
            "The two-line interactive music scores presented here are from arrangements made for tin whistles by the English-born classical musician and dedicated arranger of Irish music Carl G. Hardebeck (1869−1945; Hardebec in Irish). They were published in 1937 as Ceol na nGaedheal (music of the Irish), a small inexpensive collection suitable for school use, by the Dublin educational publishers Browne & Nolan Ltd (Brún agus Ó Nualláin Teor. in Irish). The scores were added to the site on the 70th anniversary of Hardebeck's death on 10 February 1945.", 
            "The booklet contains twenty-five popular national airs and dance tunes, and a basic tutorial introduction which views the tin whistle as an easy and cheap means of initiation to playing music for all children. With a view to giving easy access to the reading of music, its melodies are set in the tonic sol-fa notation which had been widely used in Irish primary schools since the 19th century.", 
            "The arrangements were produced in Hardebeck’s last years, when he was living in poverty in Dublin, and they may have been commissioned from him as a practical support. Nevertheless they are interesting and original, and he evidently undertook the work seriously. The first line of tonic sol-fa generally carries the melody and the second provides harmony, but occasionally the melody alternates between the two lines.", 
            "Given that Hardebeck was blind and unable to proofread, and that the typesetters probably did not read music, there are very few errors in the book’s musical content. It is very likely that items from this book fed into the live tradition, and probable echoes of it can be heard in the repertories of prominent Irish 20th-century musicians. For a facsimile of Ceol na nGaedheal see http://www.itma.ie/digitallibrary/book/ceol-na-ngaedheal.", 
            "NC & JS"
        ], 
        "title": "Ceol na nGaedheal / gléasta d'fheadógaibh ag Carl G. Hardebec",
        "short_title" : "Ceol na nGaedheal",
        "keywords": "hardebeck carl ceol na ngaedheal hardebec tin whistle"
    }, 
    {
        "author": "Carl G. Hardebec", 
        "collector": "Carl G. Hardebec", 
        "decade": "1920s", 
        "geolocation": {
            "lat": 54.5982897, 
            "placename": "Belfast", 
            "lng": -5.892588199999977
        }, 
        "itma_collection_id": "hardebeck_port_cor_pt_1", 
        "itma_pub_order": 36, 
        "name": "Carl Hardebec", 
        "people": [
            "Carl Hardebec", 
            "Carl G. Hardebec"
        ], 
        "publication_date": "1921", 
        "publication_details": "Dublin : Sullivan, 1921", 
        "text": [
            "The two-line interactive music scores presented here are from published arrangements of traditional dance tunes made for piano sometime before or in 1921 by the English-born classical musician and dedicated arranger of Irish music Carl G. Hardebeck (1869−1945). They were published first in Dublin in two slim volumes by the obscure Crow St firm of Sullivan & Co, presumably in the early 1920s, and were republished and kept in print by the large Dublin specialist music publishers Pigott & Co of Grafton St. Facsimiles of the two published collections are available http://www.itma.ie/digitallibrary/print-collection/carl-hardebeck-instrumental-collections-of-the-1920s-1930s.", 
            "The 53 dance tunes of the volumes comprise, in Hardebeck’s classification,  jigs and reels in a ratio of about 2:3, a hornpipe and a ‘fancy dance’. Some of his reels would however nowadays be regarded as hornpipes or set dances. His main sources were fiddlers − Sean O’Gorman of Co Galway, Treasa Halpin of Limerick, a Mr O’Curran of Co Waterford, and a John Duffy among them – and he tells us that his elaborate arrangements seek to imitate fiddle style, and are meant also to be played with a delicate early harpsichord tone. They are listening pieces, not intended for dancing. An indirect source, through O’Curran, was the Co Waterford fiddle player and Irish music theorist Fr Richard Henebry. O’Gorman had been taught by a Co Clare fiddle master and dance teacher, Lynch, and Hardebeck recommends the slow pace of his performances.", 
            "It seems clear that Hardebeck, in contrast to 19th-century arrangers of Irish music, adheres conscientiously to the tune versions and performance practice of his source musicians. He takes scrupulous care with the reproduction of traditional rhythms, for example, by making extensive use of crotchet-and-quaver triplets to represent the elusive traditional reel rhythm. He also faithfully reports a sharpened fourth interval where it occurs, in situations where a standard fourth would be preferred in standard usage today; he thus regularly specifies the Fah mode (which has now virtually disappeared from the tradition) for tunes that incorporate this phenomenon, which is amply attested in early sound recordings.", 
            "NC & JS"
        ], 
        "title": "Cnuasacht port agus cor do'n bpiano. Cuid a h-aon / Carl G. Hardebec do ghléas = A collection of jigs and reels / arranged for piano by Carl G. Hardebeck"
        ,"short_title": "Cnuasacht port & cor do'n bpiano. Cuid a h-aon",
        "keywords": "hardebeck carl cnuasach port agus cor do'n piano h-aon part 1"
    }, 
    {
        "author": "Carl G. Hardebec", 
        "collector": "Carl G. Hardebec", 
        "decade": "1920s", 
        "geolocation": {
            "lat": 54.5982897, 
            "placename": "Belfast", 
            "lng": -5.892588199999977
        }, 
        "itma_collection_id": "hardebeck_port_cor_pt_2", 
        "itma_pub_order": 37, 
        "name": "Carl Hardebec", 
        "people": [
            "Carl Hardebec", 
            "Carl G. Hardebec"
        ], 
        "publication_date": "1921", 
        "publication_details": "Dublin : Sullivan, 1921", 
        "text": [
            "The two-line interactive music scores presented here are from published arrangements of traditional dance tunes made for piano sometime before or in 1921 by the English-born classical musician and dedicated arranger of Irish music Carl G. Hardebeck (1869−1945). They were published first in Dublin in two slim volumes by the obscure Crow St firm of Sullivan & Co, presumably in the early 1920s, and were republished and kept in print by the large Dublin specialist music publishers Pigott & Co of Grafton St. Facsimiles of the two published collections are available http://www.itma.ie/digitallibrary/print-collection/carl-hardebeck-instrumental-collections-of-the-1920s-1930s.", 
            "The 53 dance tunes of the volumes comprise, in Hardebeck’s classification,  jigs and reels in a ratio of about 2:3, a hornpipe and a ‘fancy dance’. Some of his reels would however nowadays be regarded as hornpipes or set dances. His main sources were fiddlers − Sean O’Gorman of Co Galway, Treasa Halpin of Limerick, a Mr O’Curran of Co Waterford, and a John Duffy among them – and he tells us that his elaborate arrangements seek to imitate fiddle style, and are meant also to be played with a delicate early harpsichord tone. They are listening pieces, not intended for dancing. An indirect source, through O’Curran, was the Co Waterford fiddle player and Irish music theorist Fr Richard Henebry. O’Gorman had been taught by a Co Clare fiddle master and dance teacher, Lynch, and Hardebeck recommends the slow pace of his performances.", 
            "It seems clear that Hardebeck, in contrast to 19th-century arrangers of Irish music, adheres conscientiously to the tune versions and performance practice of his source musicians. He takes scrupulous care with the reproduction of traditional rhythms, for example, by making extensive use of crotchet-and-quaver triplets to represent the elusive traditional reel rhythm. He also faithfully reports a sharpened fourth interval where it occurs, in situations where a standard fourth would be preferred in standard usage today; he thus regularly specifies the Fah mode (which has now virtually disappeared from the tradition) for tunes that incorporate this phenomenon, which is amply attested in early sound recordings.", 
            "NC & JS"
        ], 
        "title": "Cnuasacht port agus cor do'n bpiano. Cuid a dó / Carl G. Hardebec do ghléas = A collection of jigs and reels. Part II / arranged for piano by Carl G. Hardebeck"
        ,"short_title": "Cnuasacht port & cor do'n bpiano. Cuid a dó",
        "keywords": "hardebeck carl cnuasach port agus cor do'n piano part 2"        
    }, 
    {
        "author": "Charles Villiers Stanford", 
        "collector": [
            "George Petrie", 
            "P.W. Joyce"
        ], 
        "decade": "1900s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "pw_joyce_stanford", 
        "itma_pub_order": 18, 
        "name": "Charles Villiers Stanford", 
        "people": [
            "P.W. Joyce", 
            "George Petrie", 
            "Charles Villiers Stanford"
        ], 
        "publication_date": "1902", 
        "publication_details": "London: For the Irish Literary Society of London by Boosey & Co., c1902", 
        "text": [
            "By the mid-nineteenth century, the Dublin professional artist and antiquarian George Petrie (c. 1790-1866) was recognised as the doyen of Irish traditional music collectors, and when in December 1851 the new Society for the Preservation and Publication of the Melodies of Ireland was established in Dublin, Petrie was the obvious choice as its president. The main immediate aim of the Society was to publish selections from the music manuscript collections which he had been making for over thirty years in the field and to which many other collectors had contributed. Joyce came into contact with Petrie about this time, and he was encouraged by the older man, who was some forty years his senior and whom he venerated, to contribute tunes and dance information to his collections, and to make his own collection.", 
            "In all, Joyce gave over 180 Co Limerick tunes to Petrie who published some 20 of them in his 1855 volume Ancient Music of Ireland, the first time that Joyce had achieved publication. After Petrie’s death in 1866 a handful of Joyce tunes appeared in an incomplete Petrie volume of 1882, some 15 in Francis Hoffmann’s 1877 Dublin publication Ancient Music of Ireland from the Petrie Collection Arranged for the Pianoforte, and some 160 in Charles V. Stanford’s 1902–1905 London edition of The Complete Petrie Collection of Ancient Irish Music."
        ], 
        "title": "The complete collection of Irish music / as noted by George Petrie (1789-1866) ; edited, from the original manuscripts by Charles Villiers Stanford"
        ,"short_title":"P.W. Joyce in Petrie Stanford",
        "keywords": "pw p.w. joyce petrie stanford george charles villiers"
    }, 
    {
        "author": "Colm Ó Lochlainn", 
        "collector": "Colm Ó Lochlainn", 
        "decade": [
            "1930s", 
            "1940s"
        ], 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "claisceadal", 
        "itma_pub_order": 11, 
        "name": "Colm Ó Lochlainn", 
        "people": [
            "Colm Ó Lochlainn"
        ], 
        "publication_date": "1930", 
        "publication_details": "[Dublin : At the Sign of the Three Candles, 1930-1940]", 
        "text": [
            "About 1940 Colm Ó Lochlainn began the publication in Dublin of an undated series of penny Irish-language songsheets entitled An Claisceadal (‘choral singing’).", 
            "By 1941 eighteen numbers had been published, produced by his Three Candles Press, and the series continued into the 1940s until it ended with the publication of sheet number 36.  The entire series is reproduced as scorch files below, and as a facsimile here.", 
            "These sheets were the latest manifestation of a number of influential Irish-language song publications by Colm Ó Lochlainn which bear the title of An Claisceadal. This was originally the name of an informal choral group of Irish-language enthusiasts which had been brought together in Dublin in 1928 by Ó Lochlainn and by Fionán Mac Coluim, a Gaelic League organiser from Kerry. The singers were accompanied on piano by a Sligo music student Michael Bowles (Mícheál Ó Baoighill), later director of music on Radio Éireann and conductor of the National Orchestra of New Zealand. In the early 1930s Ó Lochlainn began publishing a series of booklets of song texts sung by the group. These were taken up enthusiastically by Gaelic League branches, and the songs they contain became generally popular and widely sung.", 
            "Colm Ó Lochlainn was a polymath: a Dublin printer, type designer and publisher, a political activist, an Irish scholar and Irish-language enthusiast, an editor of publications and journals, a singer and musician. For more on Ó Lochlainn see below.", 
            "Colm Ó Lochlainn’s Irish-language songsheet series was clearly modelled on the old tradition of cheap printed street ballads. In contrast to street balladsheets, the Claisceadal sheets are printed on strong paper and on both sides – usually carrying two songs per sheet – and they also give the melody for each song, in staff notation. Each sheet was relatively small (12 x 19 cm). The sixty-nine songs of the series, some of them collected by Ó Lochlainn himself, are from the then living traditions of the gaeltachtaí (Irish-speaking districts), notably those of Conamara, Mayo and Munster. They are mostly light cheerful songs (‘amhráin mheidhreacha’): lullabies, dandling and other children’s songs, spinning and other work songs, and love songs. The melodies are strong and regular, and many are also dance tunes. Some of the music notations seem to be in the hand of the famous traditional musician, singer and music collector Séamus Ennis, who worked for Ó Lochlainn in the years about 1940. For facsimile reproductions of these songsheets, and more information on Colm Ó Lochlainn see http://www.itma.ie/digitallibrary/print-collection/claisceadal-songsheets."
        ], 
        "title": "An claisceadal. [Duilleacháin 1-36] / [Colm Ó Lochlainn, ed.]",
        "short_title": "An Claisceadal Leaflets",
        "keywords": "claisceadal leaflets colm o lochlainn dublin"
    }, 
    {
        "author": "Edward Bunting", 
        "collector": "Edward Bunting", 
        "decade": "1790s", 
        "geolocation": {
            "lat": 54.5982897, 
            "placename": "Belfast", 
            "lng": -5.892588199999977
        }, 
        "itma_collection_id": "bunting_vol_1", 
        "itma_pub_order": 40, 
        "name": "Edward Bunting", 
        "people": [
            "Edward Bunting"
        ], 
        "publication_date": "1796", 
        "publication_details": [
            "London : Printed & sold by Preston & Son at their Wholesale Warehouses 97 Strand, [1796]"
        ], 
        "text": "", 
        "title": "A general collection of the ancient Irish music : containing a variety of admired airs never before published, and also the compositions of Conolan and Carolan. Vol. 1 / collected from the harpers &c. in the different provinces or Ireland, and adapted for the piano forte with a prefatory introduction by Edward Bunting"
        ,"short_title":"Bunting 1",
        "keywords": "edward bunting volume 1 ancient irish music a general collection belfast carolan harp piano"
    }, 
    {
        "author": "Edward Bunting", 
        "collector": "Edward Bunting", 
        "decade": "1800s", 
        "geolocation": {
            "lat": 54.5982897, 
            "placename": "Belfast", 
            "lng": -5.892588199999977
        }, 
        "itma_collection_id": "bunting_vol_2", 
        "itma_pub_order": 41, 
        "name": "Edward Bunting", 
        "people": [
            "Edward Bunting"
        ], 
        "publication_date": "1809", 
        "publication_details": [], 
        "text": "", 
        "title": "Bunting Volume 2",
        "short_title":"Bunting 2",
        "keywords": "edward bunting volume 2 harp piano"

    }, 
    {
        "author": "Edward Bunting", 
        "collector": "Edward Bunting", 
        "decade": "1840s", 
        "geolocation": {
            "lat": 54.5982897, 
            "placename": "Belfast", 
            "lng": -5.892588199999977
        }, 
        "itma_collection_id": "bunting_vol_3", 
        "itma_pub_order": 42, 
        "name": "Edward Bunting", 
        "people": [
            "Edward Bunting"
        ], 
        "publication_date": "1840", 
        "publication_details": [], 
        "text": "", 
        "title": "Bunting Volume 3",
        "short_title":"Bunting 3",
        "keywords": "edward bunting volume 3 harp piano"
    }, 
    {
        "author": "Francis Roche", 
        "collector": "Francis Roche", 
        "decade": "1910s", 
        "geolocation": {
            "lat": 52.42677519999999, 
            "placename": "Elton, Co. Limerick", 
            "lng": -8.457163400000013
        }, 
        "itma_collection_id": "roche_vol_1", 
        "itma_pub_order": 13, 
        "name": "Francis Roche", 
        "people": [
            "Francis Roche"
        ], 
        "publication_date": "1912", 
        "publication_details": "Dublin : Pigott, 1912", 
        "text": [
            "Francis Roche (1866–1961) from the village of Elton in south Co Limerick was a violinist, pianist and dancer, and a teacher of music and dance. His father and two brothers were of the same profession, and they ran a family academy in Limerick city from about 1900 and later in Elton with outreach to neighbouring areas. They taught Irish music and Irish dancing, but also popular classical music and ballroom dancing.", 
            "From about 1890, Francis was engaged in compiling and arranging a collection of Irish music for publication. He was motivated by demand from pupils and fellow-teachers but also by the example of the published collections of Francis O’Neill in Chicago and especially by those of his fellow Limerick man P.W. Joyce, who loaned him manuscripts. Roche’s initial collection appeared in two volumes in January 1912.", 
            "The contents were noted down from oral tradition and from manuscripts of his father and others. It is clear from the performance markings throughout that his primary target instrument was the fiddle. The inclusion of such features as cadenzas and artificial harmonics (especially in the airs) makes it clear that a very high standard of proficiency, necessitating training in classical music, was required for some of the pieces. As an enthusiastic nationalist and Gaelic Leaguer, Roche mainly published Irish traditional tunes, and he had theories about the character and techniques of Irish traditional music. But he also included international quadrille and fling melodies on the grounds that the related dances were widely danced in Ireland and their melodies had become ‘Irish by association’.", 
            "The two volumes had a print-run of 4,000 copies, which quickly sold out and were reprinted. Roche revised them both for republication with a third volume in 1927. "
        ], 
        "title": "Collection of Irish airs, marches & dance tunes.  Vol. 1. / compiled and arranged for violin, mandoline, pipes or flute by F. Roche; with introduction by Charles J. Brennan"
        ,"short_title": "Francis Roche Collection 1",
        "keywords":"francis roche collection volume 1 violin fiddle limerick"
    }, 
    {
        "author": "Francis Roche", 
        "collector": "Francis Roche", 
        "decade": "1910s", 
        "geolocation": {
            "lat": 52.42677519999999, 
            "placename": "Elton, Co. Limerick", 
            "lng": -8.457163400000013
        }, 
        "itma_collection_id": "roche_vol_2", 
        "itma_pub_order": 14, 
        "name": "Francis Roche", 
        "people": [
            "Francis Roche"
        ], 
        "publication_date": "1912", 
        "publication_details": "Dublin : Pigott, 1912", 
        "text": [
            "Francis Roche (1866–1961) from the village of Elton in south Co Limerick was a violinist, pianist and dancer, and a teacher of music and dance. His father and two brothers were of the same profession, and they ran a family academy in Limerick city from about 1900 and later in Elton with outreach to neighbouring areas. They taught Irish music and Irish dancing, but also popular classical music and ballroom dancing.", 
            "From about 1890, Francis was engaged in compiling and arranging a collection of Irish music for publication. He was motivated by demand from pupils and fellow-teachers but also by the example of the published collections of Francis O’Neill in Chicago and especially by those of his fellow Limerick man P.W. Joyce, who loaned him manuscripts. Roche’s initial collection appeared in two volumes in January 1912.", 
            "The contents were noted down from oral tradition and from manuscripts of his father and others. It is clear from the performance markings throughout that his primary target instrument was the fiddle. The inclusion of such features as cadenzas and artificial harmonics (especially in the airs) makes it clear that a very high standard of proficiency, necessitating training in classical music, was required for some of the pieces. As an enthusiastic nationalist and Gaelic Leaguer, Roche mainly published Irish traditional tunes, and he had theories about the character and techniques of Irish traditional music. But he also included international quadrille and fling melodies on the grounds that the related dances were widely danced in Ireland and their melodies had become ‘Irish by association’.", 
            "The two volumes had a print-run of 4,000 copies, which quickly sold out and were reprinted. Roche revised them both for republication with a third volume in 1927. "
        ], 
        "title": "Collection of Irish airs, marches & dance tunes.  Vol. 2. / compiled and arranged for violin, mandoline, pipes or flute by F. Roche; with introduction by Charles J. Brennan"
        ,"short_title": "Francis Roche Collection 2",
        "keywords":"francis roche collection volume 2 violin fiddle limerick"
    }, 
    {
        "author": "Francis Roche", 
        "collector": "Francis Roche", 
        "decade": "1910s", 
        "geolocation": {
            "lat": 52.42677519999999, 
            "placename": "Elton, Co. Limerick", 
            "lng": -8.457163400000013
        }, 
        "itma_collection_id": "roche_vol_3", 
        "itma_pub_order": 15, 
        "name": "Francis Roche", 
        "people": [
            "Francis Roche"
        ], 
        "publication_date": "1912", 
        "publication_details": "Dublin : Pigott, 1912", 
        "text": [
            "Francis Roche (1866–1961) from the village of Elton in south Co Limerick was a violinist, pianist and dancer, and a teacher of music and dance. His father and two brothers were of the same profession, and they ran a family academy in Limerick city from about 1900 and later in Elton with outreach to neighbouring areas. They taught Irish music and Irish dancing, but also popular classical music and ballroom dancing.", 
            "From about 1890, Francis was engaged in compiling and arranging a collection of Irish music for publication. He was motivated by demand from pupils and fellow-teachers but also by the example of the published collections of Francis O’Neill in Chicago and especially by those of his fellow Limerick man P.W. Joyce, who loaned him manuscripts. Roche’s initial collection appeared in two volumes in January 1912.", 
            "The contents were noted down from oral tradition and from manuscripts of his father and others. It is clear from the performance markings throughout that his primary target instrument was the fiddle. The inclusion of such features as cadenzas and artificial harmonics (especially in the airs) makes it clear that a very high standard of proficiency, necessitating training in classical music, was required for some of the pieces. As an enthusiastic nationalist and Gaelic Leaguer, Roche mainly published Irish traditional tunes, and he had theories about the character and techniques of Irish traditional music. But he also included international quadrille and fling melodies on the grounds that the related dances were widely danced in Ireland and their melodies had become ‘Irish by association’.", 
            "The two volumes had a print-run of 4,000 copies, which quickly sold out and were reprinted. Roche revised them both for republication with a third volume in 1927. "
        ], 
        "title": "Collection of Irish airs, marches & dance tunes.  Vol. 3. / compiled and arranged for violin, mandoline, pipes or flute by F. Roche; with introduction by Charles J. Brennan"
        ,"short_title": "Francis Roche Collection 3",
        "keywords":"francis roche collection volume 3 violin fiddle limerick"

    }, 
    {
        "author": "Francis Roche", 
        "collector": "Francis Roche", 
        "decade": "1930s", 
        "geolocation": {
            "lat": 52.42677519999999, 
            "placename": "Elton, Co. Limerick", 
            "lng": -8.457163400000013
        }, 
        "itma_collection_id": "roche_vol_4", 
        "itma_pub_order": 16, 
        "name": "Francis Roche", 
        "people": [
            "Francis Roche"
        ], 
        "publication_date": "1932", 
        "publication_details": "Dublin : Pigott, 1932", 
        "text": [
            "Francis Roche (1866–1961) from the village of Elton in south Co Limerick was a violinist, pianist and dancer, and a teacher of music and dance. His father and two brothers were of the same profession, and they ran a family academy in Limerick city from about 1900 and later in Elton with outreach to neighbouring areas. They taught Irish music and Irish dancing, but also popular classical music and ballroom dancing.", 
            "From about 1890, Francis was engaged in compiling and arranging a collection of Irish music for publication. He was motivated by demand from pupils and fellow-teachers but also by the example of the published collections of Francis O’Neill in Chicago and especially by those of his fellow Limerick man P.W. Joyce, who loaned him manuscripts. Roche’s initial collection appeared in two volumes in January 1912.", 
            "The contents were noted down from oral tradition and from manuscripts of his father and others. It is clear from the performance markings throughout that his primary target instrument was the fiddle. The inclusion of such features as cadenzas and artificial harmonics (especially in the airs) makes it clear that a very high standard of proficiency, necessitating training in classical music, was required for some of the pieces. As an enthusiastic nationalist and Gaelic Leaguer, Roche mainly published Irish traditional tunes, and he had theories about the character and techniques of Irish traditional music. But he also included international quadrille and fling melodies on the grounds that the related dances were widely danced in Ireland and their melodies had become ‘Irish by association’.", 
            "The first two volumes had a print-run of 4,000 copies, which quickly sold out and were reprinted. Roche revised them both for republication with a third volume in 1927. This fourth volume was published in 1932."
        ], 
        "title": "Airs and Fantasies Vol 4 : a book of operatic selections, ballads and traditional airs, compiled and arranged with bowing and marks of expression for violin solo / Frank Roche. Dublin : Pigott, 1932"
        ,"short_title": "Francis Roche Collection 4",
        "keywords":"francis roche collection volume 4 violin fiddle limerick"        
    }, 
    {
        "author": "George Petrie", 
        "collector": "George Petrie", 
        "decade": "1850s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "pw_joyce_petrie_1855", 
        "itma_pub_order": 17, 
        "name": "George Petrie", 
        "people": [
            "George Petrie"
        ], 
        "publication_date": "1855", 
        "publication_details": "Dublin : Society for the Preservation and Publication of the Melodies of Ireland, 1855", 
        "text": [
            "By the mid-nineteenth century, the Dublin professional artist and antiquarian George Petrie (c. 1790-1866) was recognised as the doyen of Irish traditional music collectors, and when in December 1851 the new Society for the Preservation and Publication of the Melodies of Ireland was established in Dublin, Petrie was the obvious choice as its president. The main immediate aim of the Society was to publish selections from the music manuscript collections which he had been making for over thirty years in the field and to which many other collectors had contributed. Joyce came into contact with Petrie about this time, and he was encouraged by the older man, who was some forty years his senior and whom he venerated, to contribute tunes and dance information to his collections, and to make his own collection.", 
            "In all, Joyce gave over 180 Co Limerick tunes to Petrie who published some 20 of them in his 1855 volume Ancient Music of Ireland, the first time that Joyce had achieved publication. After Petrie’s death in 1866 a handful of Joyce tunes appeared in an incomplete Petrie volume of 1882, some 15 in Francis Hoffmann’s 1877 Dublin publication Ancient Music of Ireland from the Petrie Collection Arranged for the Pianoforte, and some 160 in Charles V. Stanford’s 1902–1905 London edition of The Complete Petrie Collection of Ancient Irish Music."
        ], 
        "title": "The Petrie collection of the ancient music of Ireland : arranged for piano-forte.  Vol 1 / edited by George Petrie"
        ,"short_title":"P.W. Joyce in Petrie 1855",
        "keywords": "p.w. pw joyce petric 1855 limerick ancient music of ireland piano-forte piano"
    }, 
    {
        "author": "George Petrie", 
        "collector": "George Petrie", 
        "decade": "1880s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "pw_joyce_petrie_1882", 
        "itma_pub_order": 19, 
        "name": "George Petrie", 
        "people": [
            "George Petrie"
        ], 
        "publication_date": "1882", 
        "publication_details": "[Dublin] : [M.H. Gill & Son], [1882]", 
        "text": [
            "By the mid-nineteenth century, the Dublin professional artist and antiquarian George Petrie (c. 1790-1866) was recognised as the doyen of Irish traditional music collectors, and when in December 1851 the new Society for the Preservation and Publication of the Melodies of Ireland was established in Dublin, Petrie was the obvious choice as its president. The main immediate aim of the Society was to publish selections from the music manuscript collections which he had been making for over thirty years in the field and to which many other collectors had contributed. Joyce came into contact with Petrie about this time, and he was encouraged by the older man, who was some forty years his senior and whom he venerated, to contribute tunes and dance information to his collections, and to make his own collection.", 
            "In all, Joyce gave over 180 Co Limerick tunes to Petrie who published some 20 of them in his 1855 volume Ancient Music of Ireland, the first time that Joyce had achieved publication. After Petrie’s death in 1866 a handful of Joyce tunes appeared in an incomplete Petrie volume of 1882, some 15 in Francis Hoffmann’s 1877 Dublin publication Ancient Music of Ireland from the Petrie Collection Arranged for the Pianoforte, and some 160 in Charles V. Stanford’s 1902–1905 London edition of The Complete Petrie Collection of Ancient Irish Music."
        ], 
        "title": "Music of Ireland / collected, edited, and harmonized for the pianoforte by the late George Petrie"
        ,"short_title":"P.W. Joyce in Petrie 1882",  
        "keywords": "p.w. pw joyce petric 1882 limerick  music of ireland piano-forte piano"
    }, 
    {
        "author": "Honoria Galwey", 
        "collector": "Honoria Galwey", 
        "decade": "1910s", 
        "geolocation": {
            "lat": [
                54.8661152, 
                54.9966124
            ], 
            "placename": [
                "Donegal", 
                "Derry"
            ], 
            "lng": [
                -7.9954086999999845, 
                -7.308574799999974
            ]
        }, 
        "itma_collection_id": "galwey_croonauns", 
        "itma_pub_order": 33, 
        "name": "Honoria Galwey", 
        "people": [
            "Honoria Galwey"
        ], 
        "publication_date": "1910", 
        "publication_details": "London : Boosey, [1910]", 
        "text": "Music scores of traditional melodies collected by Honoria Galwey in Donegal and Derry. She published most of these in her collection Old Irish Croonauns and Other Tunes of 1910 which has already been uploaded to the ITMA site http://www.itma.ie/digitallibrary/book/old-irish-croonauns in facsimile.", 
        "title": "Old Irish croonauns and other tunes / re-collected and collected by Miss Honoria Galwey",
        "short_title": "Old Irish Croonauns & Other Tunes",
        "keywords": "old irish croonauns other tunes honoria galwey donegal derry"
    }, 
    {
        "author": "Hugh McDermott", 
        "collector": "Hugh McDermott", 
        "decade": "1950s", 
        "geolocation": {
            "lat": 55.864237, 
            "placename": "Glasgow", 
            "lng": -4.251805999999988
        }, 
        "itma_collection_id": "allans_irish_fiddler", 
        "itma_pub_order": 20, 
        "name": "Hugh McDermott", 
        "people": [
            "Hugh McDermott"
        ], 
        "publication_date": "1953", 
        "publication_details": "84 Carlton Place, Glasgow : Mozart Allan, [n.d.]", 
        "text": [
            "The undated Glasgow publication Allan’s ‘Irish Fiddler’ has been an entry-level tunebook for aspiring fiddle players of Irish traditional music for over 60 years now. A cheap publication which has been widely distributed, it contains a substantial body of popular tunes, and is still available. Anyone who has absorbed its contents and learned to read its notations is well equipped to make progress in the music. In spite of the ‘120’ tunes mentioned on its title-page, the collection actually contains 131 melodies in 121 numbered sections. Interactive music scores for the 131 are presented here; for pdf versions suitable for printing click on the bottom right of each score.", 
            "The origins of the collection are something of a mystery. Its first date of publication is not now known; the earliest association date ITMA has been able to discover is April 1953. Although the book has been extensively used for decades, very few libraries hold copies; it is a perfect illustration of a common publication that was below the radar of most librarians. With its high proportion of tunes made current from the 1920s onward on gramophone records by Irish-American star performers like Michael Coleman and James Morrison, the collection seems to have been compiled in the mid-twentieth century. The identity of Hugh McDermott is likewise now a mystery. Was he an Irishman living in Scotland, or a Scot of Irish ancestry? Given the dance-music orientation of his collection and the appropriateness of his markings for fiddle fingering and bowing, he was probably an active fiddle player who provided music for feis or ceili dancers.", 
            "Mozart Allan, publisher of the collection and member of a music-publishing family active in Glasgow since the 1820s, was a prolific publisher of Scottish and general popular music in the twentieth century. This present collection was followed up by the firm's publication of Allan’s ‘Irish Pianist’ (Piano Part of the Irish Fiddler) with the 131 tunes split into two separately published parts edited by Ian MacLeish and arranged for piano and piano-accordion. It is similarly undated but may possibly be a publication of the late 1980s (Part 1 was purchased by ITMA in January 1989, Part 2 in July 1990). The Mozart Allan firm has ceased trading within the last decade.", 
            "With thanks to the Breathnach family, donors of the ITMA copy of the book, and to Reg Hall, Paddy Glackin, and Almut Boehme, Head of Music, National Library of Scotland Rare Books and Music Collections, for information. ITMA would be glad to learn more about Hugh McDermott and the different versions of his collection: email any further information to donations@itma.ie.", 
            "NC & JS"
        ], 
        "title": "Allan's Irish fiddler : containing 120 reels & jigs, hornpipes & set dances, selected from all sources / arranged by Hugh McDermott"
        ,"short_title":"Allan's Irish Fiddler",
        "keywords": "allan's irish fiddler hugh mcdermott fiddle"
    }, 
    {
        "author": "James C. Morrison", 
        "collector": "James C. Morrison", 
        "decade": "1930s", 
        "geolocation": {
            "lat": 40.7127837, 
            "placename": "New York", 
            "lng": -74.00594130000002
        }, 
        "itma_collection_id": "morrison_tutor", 
        "itma_pub_order": 10, 
        "name": "James C. Morrison", 
        "people": [
            "James C. Morrison"
        ], 
        "publication_date": "1931", 
        "publication_details": "New York : C. Meisel, Inc., c1931", 
        "text": [
            "By the 1920s, melodeons and accordions had become well established in Irish traditional music, especially in Irish America where they were popular band instruments. Agents for Globe accordions in particular were successfully targeting Irish players in the United States by the mid-1920s with a variety of amateur and professional instruments, and using the prominent Cork-Boston accordion player Jerry O’Brien in advertising campaigns. At the end of the decade New York resident James C. Morrison of Riverstown, Co Sligo, well known in the city on stage, record and radio, was commissioned to write a tutor for the Globe accordion. ‘Professor’ Morrison (1893–1947) was primarily famous as a fiddle player, but he also sold, played and taught the accordion, among other instruments. He included in the tutor a selection of tunes suitable for beginners, reproduced on the left, from the popular contemporary repertory, most of which had been published on Irish commercial recordings in New York.", 
            "The diatonic Globe accordion for which Morrison wrote the tutor would today be described as a ten-key melodeon. Since he left no recordings as an accordion or melodeon player, we have no idea of his proficiency on the instrument, but he is known to have had close associations with noted players of the instrument of his day, including the melodeon player P.J. Conlon and the accordionist Tom Carmody, with both of whom he recorded. While the ten-key melodeon has great expressive possibilities, particularly for dance music, it is quite limited in musical compass in comparison to other instruments in the Irish tradition. Judging from his music scores, Morrison had a well-grounded understanding of the strengths and limitations of the instrument. He modifies tunes where necessary to fit them to the compass of the instrument, and carefully tailors each element of the scores to its characteristics.", 
            "A Globe accordion played by James Morrison in New York has recently been donated to the James Morrison Music Festival in his native Riverstown: see here. For a biography of Morrison by Harry Bradshaw and 30 remastered tracks of his music, see the double audio cassette James Morrison: The Professor (Viva Voce 001, Dublin, 1989). Morrison’s tutor and tune book of 1931 was doubtless an exemplar for an accordion tutor and tune book of 1949 by Jerry O’Brien in Boston (see http://www.itma.ie/digitallibrary/score/JOB_ACC1).", 
            "ITMA has a photocopy of Morrison’s accordion tutor, kindly donated to it by Hugh E. O'Rourke of New York, from which these tunes were set. It would always welcome a donation of the original tutor, or a loan of it for digital scanning."
        ], 
        "title": "The Meisel simplified method : how to play the globe accordeon : Irish style : an easy and practical method for self-instruction : also contains selections of Irish reels, jigs, hornpipes, long dances, airs, ballads and other popular music / arranged by James C. Morrison"
        ,"short_title":"James C. Morrison's Accordion Tutor",
        "keywords": "james morrison morrison's accordion tutor new york usa"
    }, 
    {
        "author": "Jerry O'Brien", 
        "collector": "Jerry O'Brien", 
        "decade": "1940s", 
        "geolocation": {
            "lat": 42.3151978, 
            "placename": "Roxbury, Massachusetts", 
            "lng": -71.09137479999998
        }, 
        "itma_collection_id": "obrien_tutor", 
        "itma_pub_order": 8, 
        "name": "Jerry O'Brien", 
        "people": [
            "Jerry O'Brien"
        ], 
        "publication_date": "1949", 
        "publication_details": "Roxbury, Massachusetts : E. O'Byrne DeWitt's Sons, c 1949", 
        "text": [
            "Accordion player Jerry O’Brien, a native of Kinsale, Co Cork, came to Boston in 1921, and as accordionist with the recording group O’Leary’s Irish Minstrels was a leading exponent and teacher of Irish music in the city. In 1928 he also made one solo 78 rpm recording for the Columbia company of New York before the Great Depression of 1929 brought most Irish-American recording to a halt. In a period of rising prosperity after the Second World War he began recording solo again, this time for the Irish-American Copley label of Boston, and also in duet with a young local star pupil Joe Derrane. The Copley label had been set up in 1948 by Justus O’Byrne DeWitt, son of an Ellen O’Byrne DeWitt who had been involved in the recording industry in New York since 1916. O’Brien also designed for the company the O’Byrne DeWitt Irish Professional Accordion.", 
            "The success of O’Brien and Derrane’s Copley recordings gave rise to two Boston book publications by E. O'Byrne DeWitt's Sons, both compiled by Jerry O’Brien and with a repertory heavily influenced by gramophone records. The first was his accordion tutor and tune book of 1949 from which the tunes are reproduced on the left, and for which James Morrison’s 1931 tutor for the Globe accordion (see here), an instrument which O’Brien had played, was doubtless an exemplar. O’Brien’s second publication was an Irish tune book of 1952.", 
            "This tutor is primarily for the two-row accordion in D and C sharp, i.e., one of the two ‘press-and-draw’ systems used by accordion players in the Irish tradition. The system taught here (sometimes known among players as the ‘outside-in’ system) is now virtually obsolete, but it is still played by a very loyal minority of players of the Irish accordion. Prominent current players include Joe Derrane of Boston, whose music is featured in the book. The music and the musical ethos embodied in the tutor is, however, still very much alive in the Irish tradition today, thanks largely to its successful revival by the group De Danann in the 1980s.", 
            "These tunes were set from a copy of Jerry O’Brien’s tutor kindly donated to ITMA in 1989 by accordion player Frank Murphy of Syracuse, New York."
        ], 
        "title": "Jerry O'Brien's accordion instructor : for the 10 key and 19 key Irish-style accordion : containing a selection of Irish jigs, reels, hornpipes, polkas, highland flings and waltzes / arranged for accordion, flute, bagpipes and banjo by Jerry O'Brien"
        ,"short_title":"Jerry O'Brien's Accordion Instructor",
        "keywords": "jerry obrien o'brien accordion instructor roxbury massachusetts usa"
    }, 
    {
        "author": "Jerry O'Brien", 
        "collector": "Jerry O'Brien", 
        "decade": "1950s", 
        "geolocation": {
            "lat": 42.3151978, 
            "placename": "Roxbury, Massachusetts", 
            "lng": -71.09137479999998
        }, 
        "itma_collection_id": "obrien_ifdm", 
        "itma_pub_order": 9, 
        "name": "Jerry O'Brien", 
        "people": [
            "Jerry O'Brien"
        ], 
        "publication_date": "1952", 
        "publication_details": "Roxbury, Massachusetts : E. O'Byrne DeWitt's Sons, c1952", 
        "text": "Accordion player Jerry O’Brien, a native of Kinsale, Co Cork, came to Boston in 1921, and as accordionist with the recording group O’Leary’s Irish Minstrels was a leading exponent and teacher of Irish music in the city. In 1928 he also made one solo 78 rpm recording for the Columbia company of New York before the Great Depression of 1929 brought most Irish-American recording to a halt. In a period of rising prosperity after the Second World War he began recording solo again, this time for the Irish-American Copley label of Boston, and also in duet with a young local star pupil Joe Derrane. The Copley label had been set up in 1948 by Justus O’Byrne DeWitt, son of an Ellen O’Byrne DeWitt who had been involved in the recording industry in New York since 1916. O’Brien also designed for the company the O’Byrne DeWitt Irish Professional Accordion.", 
        "title": "Irish folk dance music : for violin, flute, guitar, banjo and accordion / compiled and arranged by Jerry O'Brien"
        ,"short_title":"Irish Folk Dance Music",
        "keywords" : "jerry obrien o'brien irish folk dance music roxbury massachusetts usa"
    }, 
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1900s", 
        "geolocation": {
            "lat": 52.6680204, 
            "placename": "Limerick", 
            "lng": -8.630497500000047
        }, 
        "itma_collection_id": "pw_joyce_irish_peasant_songs", 
        "itma_pub_order": 7, 
        "name": "P.W. Joyce", 
        "people": [
            "P.W. Joyce"
        ], 
        "publication_date": "1906", 
        "publication_details": [
            "Dublin : M H Gill and Son, 1906"
        ], 
        "text": "Irish Peasant Songs is a slight publication which includes the words and music of 7 traditional songs in English remembered by Joyce from his childhood in rural Co Limerick during the years before the Great Famine, and some notes. In one case the song comprises a traditional air with words written by Joyce.", 
        "title": "Irish peasant songs in the English language / the words set to the proper old Irish airs by P.W. Joyce",
        "short_title":"Irish Peasant Songs",
        "keywords" : "pw p.w. joyce irish peasant songs limerick"
    }, 
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1880s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "pw_joyce_irish_music_song", 
        "itma_pub_order": 5, 
        "name": "P.W. Joyce", 
        "people": [
            "P.W. Joyce"
        ], 
        "publication_date": "1901", 
        "publication_details": "Dublin : M.H. Gill and Son, 1901", 
        "text": [
            "Joyce's Irish Music and Song: A Collection of Songs in the Irish Language (Dublin: Society for the Preservation of the Irish Language; M.H. Gill and Son, vi+[ii]+44 pp.), published in 1888, was drawn largely from printed sources. It is the first collection in which Irish-language songs are set to music, the syllables under the notes, and it was well received by a growing national movement for the revival of the Irish language and its culture."
        ], 
        "title": "Irish music and song : a collection of songs in the Irish language, set to music / edited for the Society for the Preservation of the Irish Language by P. W. Joyce"
        ,"short_title": "Irish Music & Song",
        "keywords" : "pw p.w. joyce limerick irish music and song"
    }, 
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1900s", 
        "geolocation": {
            "lat": 52.6680204, 
            "placename": "Limerick", 
            "lng": -8.630497500000047
        }, 
        "itma_collection_id": "pw_joyce_old_irish_folk_music", 
        "itma_pub_order": 6, 
        "name": "P.W. Joyce", 
        "people": [
            "P.W. Joyce"
        ], 
        "publication_date": "1909", 
        "publication_details": "Dublin : Hodges, Figgis, 1909", 
        "text": [
            "Old Irish Folk Music and Songs is Joyce’s magnum opus in Irish music. It includes the melodies of songs (some with words in English) and a variety of dance tunes.  About half come from  Joyce’s musical memories of his childhood in rural Co Limerick during the years before the Great Famine. The remainder are drawn from the then unpublished music manuscripts of the collectors William Forde and John Edward Pigot, which had been given to Joyce by the Pigot family (see Nicholas Carolan, ‘The Forde-Pigot Collection of Irish Traditional Music’ in Treasures of the Royal Irish Academy Library, Bernadette Cunningham, Siobhán Fitzpatrick, Petra Schnabel eds, Dublin 2009, pp. 256–67)."
        ], 
        "title": "Old Irish folk music and songs : a collection of 842 Irish airs and songs hitherto unpublished / edited with annotations for The Royal Society of Antiquaries of Ireland by P.W. Joyce"
        ,"short_title":"Old Irish Folk Music & Songs",
        "keywords" : "pw p.w. joyce limerick old irish folk music songs"
    }, 
    {
        "author": "Padraic Ganly", 
        "collector": "Padraic Ganly", 
        "decade": "1910s", 
        "geolocation": {
            "lat": -34.6037232, 
            "placename": "Buenos Aires", 
            "lng": -58.38159310000003
        }, 
        "itma_collection_id": "ganly", 
        "itma_pub_order": 26, 
        "name": "Padraic Ganly", 
        "people": [
            "Padraic Ganly"
        ], 
        "publication_date": "1918", 
        "publication_details": "Buenos Aires : Ganly, 1918", 
        "text": [
            "One of the most unusual collections of Irish music must be Padraic Ganly’s collection of jigs, reels, hornpipes, airs, etc., composed by himself in traditional idiom, which he had printed on 1 July 1918 by Francisco de Paula at 1053 Av. de Mayo, Buenos Aires, and which he presumably published in that Argentinian city immediately afterwards.", 
            "It is not yet known who Ganly was and how he came to be publishing his compositions so far from Ireland. But on the internal evidence of the titles he gave to his 110 tunes, he was Irish-born and of rural origins. Townland names and other placenames abound in the collection. They are overwhelmingly from Co Westmeath, with a few from the surrounding counties, and the majority refer to an area east of Lough Ree and north of Athlone. The townland of Ballynacliffy is especially singled out. With the exception of ‘Che Buono’s Rambles’, the family names of friends mentioned  – Adamson, Ginnell, Doolan, etc. – are in general accord with such a place of origin. It is likely that Ganly belonged to the Irish community in Argentina that was associated with a long tradition of emigration to that country from the Irish midlands.", 
            "Ganly was clearly an Irish-Irelander of his time: he calls the collection ‘a modest contribution to the Gaelic revival’, and dedicates it to ‘eiséirge na Gaedhilge agus go hÉirinn [na] nGaedhael’. He was also a politically conscious Irish nationalist of the 1910s who was keeping up with the latest news from home: early tunes are entitled ‘The Old Fenian’s Favourite’, ‘The Men of ‘67’ and ‘The Land for the People’, but he goes on to include ‘Our Men of Easter Week’ and ‘Ashbourne’s Fighting Gaels’, and to name tunes for ‘Countess Markievicz’ and ‘De Valera’.", 
            "The title-page of the collection indicates that the compositions are primarily intended for violin and flute, and Ganly’s titles – ‘The Strings of Nancy’s Violin’, ‘The Blind Fiddler’, ‘A Flute and Tambourine’, etc. – seem to confirm this concentration. But other musical performance is also referred to: lilting, whistling, and especially bagpiping. By this he seems to mean mouth-blown bagpiping, and some few of these tunes could have been meant for playing at public political events, as could ‘The Sinn Fein Volunteers’, a B flat march possibly intended for brass instruments. Padraic Ganly may have been a teacher of music. The notations exhibit a high degree of musical literacy and, although they are mostly set in one or two sharps or flats, which would have suited an amateur market, they are in fact technically demanding. The collection itself seems to become progressively more difficult in performance terms, and thus to have a tutorial dimension. There are also indications that at least two editions of the collection were produced: there is an errata list in the 1 July 1918 printing but these errors have been corrected in a later printing. ", 
            "ITMA would welcome any further information on Padraic Ganly and his collection at ganly@itma.ie and, since ITMA's copies are imperfect, information on any other copies of the published collection in existence.", 
            "With thanks for communications to Gearoid O'Brien of the Westmeath County Library Service, and to Paul O'Shea.", 
            "NC & JS"
        ], 
        "title": "Poblacht na hÉireann : 110 original Irish dance tunes and other pieces for violin, flute, etc. / composed by Padraic Ganly"
        ,"short_title":"Ganly's Poblacht na hÉireann",
        "keywords" : "ganly ganly's poblach na heireann irish dance tunes buenos aires"

    }, 
    {
        "author": "Ryan", 
        "collector": "? Ryan", 
        "decade": "1880s", 
        "geolocation": {
            "lat": 42.3600825, 
            "placename": "Boston", 
            "lng": -71.05888010000001
        }, 
        "itma_collection_id": "ryans", 
        "itma_pub_order": 1, 
        "name": "Ryan", 
        "people": [
            "? Ryan", 
            "Ryan"
        ], 
        "publication_date": "1883", 
        "publication_details": "Boston : Elias Howe, 1883", 
        "text": [
            "Ryan’s Mammoth Collection, published in Boston in 1883, was – and is – an important collection of traditional music, though comparatively little known among Irish traditional players today.", 
            "Most of its content was long available in the United States as 1000 Fiddle Tunes, commonly known as simply ‘Cole’s’, named after its publisher. Recently, an annotated edition of Ryan’s original edition, edited by Patrick Sky, was published by Mel Bay publications.", 
            "Ryan’s collection contains more than a thousand tunes. It was a forerunner and model for the now much better known collections of Francis O’Neill. Ryan’s book features music in a wider variety of keys and degrees of difficulty than are prevalent in the Irish tradition today. The book is known to have been a source of repertory for many prominent Irish players, including such notable players of complicated hornpipes as the fiddle players James Morrison and Seán Maguire. However, there are many extremely simple tunes in the collection as well, and this makes it a fruitful source of tunes for players of every level of competence."
        ], 
        "title": "Ryan's Mammoth collection : 1050 Reels and Jigs, Hornpipe, Clogs, Walk-Arounds, Essences, Stathspeys, Highland Flings and Contra Dances, with Figures, and How to Play Them"
        ,"short_title":"Ryan's Mammoth Collection",
        "keywords" : "ryans ryan's ryan mammoth collection coles boston usa fiddle"
    },
    {
        "author": "", 
        "collector": "", 
        "decade": "1720s", 
        "geolocation": {
            "lat": 53.3498053, 
            "placename": "Dublin", 
            "lng": -6.260309699999993
        }, 
        "itma_collection_id": "neal", 
        "itma_pub_order": 2, 
        "name": "",
        "people": [
            "John Neal", 
            "William Neal"
        ], 
        "publication_date": "1724", 
        "publication_details": "Dublin : John & William Neal, 1724", 
        "text": [
            "Forty-nine tunes of the first-ever collection of Irish music, which was published in Dublin in 1724. Some of the tunes are presented in two versions (for explanations see the ITMA facsimile edition).",
            "ITMA has also published an illustrated 118-page facsimile edition of this collection, including extensive background information, facsimile notations, notes on the individual tunes, and various appendices, for more information see http://www.itma.ie/itmashop/product/neal/"
        ], 
        "title": "A Collection of the Most Celebrated Irish Tunes: Proper for the Violin, German Flute or Hautboy / John & William Neal [eds.]",
        "short_title":"Neal : Celebrated Irish Tunes",
        "keywords" : "neal neals celebrated irish tunes carolan dublin"
    },
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1910s", 
        "geolocation": {
            "lat": 52.6680204, 
            "placename": "Limerick", 
            "lng": -8.630497500000047
        }, 
        "itma_collection_id": "pw_joyce_nli_1912", 
        "itma_pub_order": 28, 
        "name": [
            "P.W. Joyce" 
        ], 
        "people": [
            "P.W. Joyce" 
        ], 
        "publication_date": "1889-1912", 
        "publication_details": "", 
        "text": ["Joyce was still working on what would have been his final collection at the time of his death in 1914, and the two working manuscripts from which it was to be drawn were supposedly found on the table beside his bed."
        ], 
        "title": "Joyces Final Manuscripts, 1889-1912",
        "short_title": "Joyces Final Manuscripts",
        "keywords" : "pw p.w. joyce limerick final manuscripts"
    }, 
    {
        "author": "P.W. Joyce", 
        "collector": "P.W. Joyce", 
        "decade": "1850s", 
        "geolocation": {
            "lat": 52.6680204, 
            "placename": "Limerick", 
            "lng": -8.630497500000047
        }, 
        "itma_collection_id": "pw_joyce_msj25", 
        "itma_pub_order": 32, 
        "name": [
            "P.W. Joyce" 
        ], 
        "people": [
            "P.W. Joyce" 
        ], 
        "publication_date": "1856", 
        "publication_details": "", 
        "text": ["Irish airs collected by P.W Joyce, chiefly in Co. Limerick, 1856."
        ], 
        "title": "Early Joyce Manuscript, 1856",
        "short_title": "Early Joyce Manuscript",
        "keywords" : "pw p.w. joyce limerick early manuscript"        
    },
    {
        "author": "", 
        "collector": "D. Curtin", 
        "decade": "1850s", 
        "geolocation": {
            "lat": [52.2891005, 52.15446069999999,52.6680204],
            "placename": ["Rockchapel, Co. Cork", "Kerry", "Limerick"], 
            "lng": [-9.144186699999977,-9.566863199999943,-8.630497500000047]
        }, 
        "itma_collection_id": "curtin_ms", 
        "itma_pub_order": 27, 
        "name": ["D. Curtin"
        ], 
        "people": ["D. Curtin"
        ], 
        "publication_date": "19th century", 
        "publication_details": "", 
        "text": ["The worn, much-used manuscript presented here gives us an historically important glimpse into an older layer of Sliabh Luachra music. It is one which predates the quadrille-based polkas and slides which now characterise the music of this region on the borders of counties Cork, Kerry and Limerick, and which are thought to have been first introduced in the late nineteenth century.",
"Perhaps the most interesting item the manuscript contains, from a historical viewpoint, is a unique version of 'Mirseil Alasdruim' (as 'Alexander Gigg') and a related tune 'Church Hill'. Both form part of a famous suite of traditional programme music which commemorated a north Cork battle of 1647. This was once popular throughout Munster, especially among uilleann pipers, but has long ago vanished from the live tradition. Also revealing of the richness of the music of the region at the time of the manuscript's compilation are the elaborate slow airs it contains.",
"The contents are otherwise typical of Irish traditional music manuscripts of its period: a mixture of jigs, reels, hornpipes, song airs, country dances, and other popular current items, including English and Scottish pieces. Many seem to have come originally from printed sources, but the semi-literate spelling of some titles  especially of those in Irish  indicates also an oral dimension to the collection. Judging from the occasional use of bowing marks, it may have been at least partly compiled by fiddle players.",
"The manuscript was acquired by Breandn Breathnach (1912-85) through an 'E. Finnegan from D. Curtin of Stagmount, Rockchapel', Co Cork. It was among the Breathnach papers donated to ITMA by his family in 1987, and it had been indexed by him for his massive file-card resources which are now also in ITMA. It has been digitised by ITMA staff for preservation and dissemination.  Interactive scores of the music are also available here.",
"The manuscript consists of twenty-one 24 x 16 cm leaves of music paper pre-printed on both sides, and hand-sewn in a homemade leather cover. It contains forty-two pages of music in varying states of legibility, written in staff notation by more than one hand and perhaps over more than one generation. The volume has been paginated twice, the second time by Breathnach, and the confused original pagination shows that the first two leaves at least are now missing from it. It is also otherwise incomplete: there are several instances of tunes lacking beginnings or ends. The manuscript has been scanned and is presented in the exact order in which it is now bound, which is sometimes in conflict with both paginations.",
"Although the manuscript is undated, it probably belongs to the mid-nineteenth century. The latest dateable item it contains is Pop Goes the Weasel, a tune which enjoyed a craze from the 1850s. A mid-century date seems confirmed by the fact that it contains no polkas or slides as such. Various names and addresses are inscribed in the manuscript: John O'Sullivan; Humphrey O' Sullivan; Edmond Scanlan, Mellan by Rockchapel, Co Cork; E. Coakley; Minnie D. Curtin; Thomas Leahy; Mrs Tom Leahy, Ballycomane, Tournafulla, Co Limerick; David Curtin; and Mike Murphy. From these, it is clear that the manuscript originally belongs to the Sliabh Luachra area.",
"The manuscript, which Breathnach called the 'Curtin manuscript', can usefully be compared with the ITMA manuscripts of the twentieth-century Sliabh Luachra fiddle and accordion teacher Pdraig O'Keeffe which are available in facsimile and as interactive music scores here. Echoes of a local slow-air tradition suggested in the Curtin manuscript may have survived into the twentieth century in the many airs played by O'Keeffe and imparted by him to his pupils.",
"With thanks to the Breathnach family.",
"NC & JS"
        ], 
        "title": "A Nineteenth-Century Sliabh Luachra Manuscript",
        "short_title": "Curtin Manuscript",
        "keywords" : "curtin manuscript sliabh luachra breathnach cork kerry limerick"    
    },            
    {
        "author": "Eugene Curry", 
        "collector": "George Petrie", 
        "decade": "1880s", 
        "geolocation": {
            "lat": 53.3770892, 
            "placename": "Co. Galway", 
            "lng": -8.944250799999963
        }, 
        "itma_collection_id": "curry_petrie_1882", 
        "itma_pub_order": 31, 
        "name": ["Eugene Curry"
        ], 
        "people": ["Eugene Curry"
        ], 
        "publication_date": "1882", 
        "publication_details": "", 
        "text": ["Tune from Eugene Curry in Ancient music of Ireland.  Vol. II / collected, edited, and harmonized for the pianoforte by the late George Petrie"
        ], 
        "title": "Tune from Eugene Curry in Petries Music of Ireland, 1882",
        "short_title": "Curry in Petrie",
        "keywords" : "curry petrie  george eugene ancient music of ireland"     
    },    
    {
        "author": "", 
        "collector": "John Clark?", 
        "decade": "1790s", 
        "geolocation": {
            "lat": 51.9884699, 
            "placename": "Co. Cork", 
            "lng": -8.764363099999969
        }, 
        "itma_collection_id": "clark_oconnell_ms", 
        "itma_pub_order": 30, 
        "name": ["John Clark", "John O'Connell"
        ], 
        "people": ["John Clark", "John O'Connell"
        ], 
        "publication_date": "1793", 
        "publication_details": "", 
        "text": ["Three pages from the John Clark / John O'Connell manuscript, donated by Colin & Nirn Hamilton. This is a composite volume containing at least three separate manuscripts. The oldest, marked as '1793' consists of dance instructions and dance tunes, as illustrated."
        ], 
        "title": "John Clark / John O'Connell manuscript, 1793",
        "short_title": "Clark / OConnell Manuscript",
        "keywords" : "clark o'connell oconnell manuscript cork"     
    },
    {
        "author": "Pdraig OKeeffe", 
        "collector": "Pdraig OKeeffe", 
        "decade": "[1940s, 1950s]", 
        "geolocation": {
            "lat": 52.20847, 
            "placename": "Glountane, Co. Kerry", 
            "lng": -9.33883000000003
        }, 
        "itma_collection_id": "padraig_okeeffe_ms_bk_1", 
        "itma_pub_order": 21, 
        "name": ["Pdraig OKeeffe"
        ], 
        "people": ["Pdraig OKeeffe"
        ], 
        "publication_date": "", 
        "publication_details": "", 
        "text": ["The famous Sliabh Luachra fiddle player and travelling fiddle-master Pdraig OKeeffe (18871963) from Glountane, near Castleisland, Co Kerry, at first followed in his fathers footsteps as the principal teacher in the local national school, but in 1920 abandoned conventional school-teaching for a more bohemian lifestyle.",
"He had inherited music from his OCallaghan mothers side of the family, and over the next four decades he taught hundreds of pupils fiddle especially and accordion and other instruments, moving in a wide circuit within striking distance of his home. An eccentric and notably witty character with a gift for musical variation, he left an indelible stamp on the music and folklore of the region, and is an example of how an individual musician may almost create a local music style.",
"In his teacher-training, OKeeffe would have learned the rudiments of staff notation and tonic solfa, but for his own teaching purposes he devised more intuitive tablature systems. For the fiddle he employed the four spaces of the music staff to correspond with the strings of the instrument, and with numerals indicating which fingers were to be pressed down. For the accordion he used numerals for the keys to be pressed and in- and out-symbols to indicate the direction of the bellows. Hundreds of the notations he left with pupils have been preserved in private hands, and two volumes of facsimiles have been published (Dan Herlihy, Sliabh Luachra Music Masters vols 1 & 2, Herlihy, Killarney, 2003 & 2007), but his music has not yet been comprehensively collected.",
"The OKeeffe fiddle and accordion manuscripts presented here below as scans have been kindly donated to ITMA by Paud Collins from Knockacur, Knocknagoshel, Co Kerry, a former accordion pupil of OKeeffes whose brothers Jer on fiddle and Dan on accordion were also pupils. The fiddle manuscripts are in Pdraig OKeeffes own hand, while the accordion manuscripts were copied for her brothers from OKeeffes originals by Paud Collinss sister Tess Drudy (who did not herself read the tablature).",
"The four sets of ITMA-Collins O'Keeffe facsimile manuscripts and the interactive music scores derived from them constitute the largest body of O'Keeffe's music that is publicly available.",
"With thanks to Paud Collins, and to his son Denis Collins who was instrumental in the making of the donation.",
"NC"], 
        "title": "Pdraig OKeeffe Manuscripts.  Book One.  Fiddle",
        "short_title": "OKeeffe Fiddle MS 1",
        "keywords" : "padraig o'keeffe okeeffe manuscript 1 one kerry sliabh luachra fiddle" 
    },
    {
        "author": "Pdraig OKeeffe", 
        "collector": "Pdraig OKeeffe", 
        "decade": "[1950s, 1960s]", 
        "geolocation": {
            "lat": 52.20847, 
            "placename": "Glountane, Co. Kerry", 
            "lng": -9.33883000000003
        }, 
        "itma_collection_id": "padraig_okeeffe_ms_bk_2", 
        "itma_pub_order": 22, 
        "name": ["Pdraig OKeeffe"
        ], 
        "people": ["Pdraig OKeeffe"
        ], 
        "publication_date": "", 
        "publication_details": "", 
        "text": ["The famous Sliabh Luachra fiddle player and travelling fiddle-master Pdraig OKeeffe (18871963) from Glountane, near Castleisland, Co Kerry, at first followed in his fathers footsteps as the principal teacher in the local national school, but in 1920 abandoned conventional school-teaching for a more bohemian lifestyle.",
"He had inherited music from his OCallaghan mothers side of the family, and over the next four decades he taught hundreds of pupils fiddle especially and accordion and other instruments, moving in a wide circuit within striking distance of his home. An eccentric and notably witty character with a gift for musical variation, he left an indelible stamp on the music and folklore of the region, and is an example of how an individual musician may almost create a local music style.",
"In his teacher-training, OKeeffe would have learned the rudiments of staff notation and tonic solfa, but for his own teaching purposes he devised more intuitive tablature systems. For the fiddle he employed the four spaces of the music staff to correspond with the strings of the instrument, and with numerals indicating which fingers were to be pressed down. For the accordion he used numerals for the keys to be pressed and in- and out-symbols to indicate the direction of the bellows. Hundreds of the notations he left with pupils have been preserved in private hands, and two volumes of facsimiles have been published (Dan Herlihy, Sliabh Luachra Music Masters vols 1 & 2, Herlihy, Killarney, 2003 & 2007), but his music has not yet been comprehensively collected.",
"The OKeeffe fiddle and accordion manuscripts presented here below as scans have been kindly donated to ITMA by Paud Collins from Knockacur, Knocknagoshel, Co Kerry, a former accordion pupil of OKeeffes whose brothers Jer on fiddle and Dan on accordion were also pupils. The fiddle manuscripts are in Pdraig OKeeffes own hand, while the accordion manuscripts were copied for her brothers from OKeeffes originals by Paud Collinss sister Tess Drudy (who did not herself read the tablature).",
"The four sets of ITMA-Collins O'Keeffe facsimile manuscripts and the interactive music scores derived from them constitute the largest body of O'Keeffe's music that is publicly available.",
"With thanks to Paud Collins, and to his son Denis Collins who was instrumental in the making of the donation.",
"NC"], 
        "title": "Pdraig OKeeffe Manuscripts.  Book Two.  Fiddle",
        "short_title": "OKeeffe Fiddle MS 2",
        "keywords" : "padraig o'keeffe okeeffe manuscript 2 two kerry sliabh luachra fiddle" 
    },         
    {
        "author": "Pdraig OKeeffe", 
        "collector": "Tess Drudy", 
        "decade": "[1950s, 1960s]", 
        "geolocation": {
            "lat": 52.20847, 
            "placename": "Glountane, Co. Kerry", 
            "lng": -9.33883000000003
        }, 
        "itma_collection_id": "padraig_okeeffe_ms_bk_3", 
        "itma_pub_order": 23, 
        "name": ["Pdraig OKeeffe", "Tess Drudy"
        ], 
        "people": ["Pdraig OKeeffe", "Tess Drudy"
        ], 
        "publication_date": "", 
        "publication_details": "", 
        "text": ["The famous Sliabh Luachra fiddle player and travelling fiddle-master Pdraig OKeeffe (18871963) from Glountane, near Castleisland, Co Kerry, at first followed in his fathers footsteps as the principal teacher in the local national school, but in 1920 abandoned conventional school-teaching for a more bohemian lifestyle.",
"He had inherited music from his OCallaghan mothers side of the family, and over the next four decades he taught hundreds of pupils fiddle especially and accordion and other instruments, moving in a wide circuit within striking distance of his home. An eccentric and notably witty character with a gift for musical variation, he left an indelible stamp on the music and folklore of the region, and is an example of how an individual musician may almost create a local music style.",
"In his teacher-training, OKeeffe would have learned the rudiments of staff notation and tonic solfa, but for his own teaching purposes he devised more intuitive tablature systems. For the fiddle he employed the four spaces of the music staff to correspond with the strings of the instrument, and with numerals indicating which fingers were to be pressed down. For the accordion he used numerals for the keys to be pressed and in- and out-symbols to indicate the direction of the bellows. Hundreds of the notations he left with pupils have been preserved in private hands, and two volumes of facsimiles have been published (Dan Herlihy, Sliabh Luachra Music Masters vols 1 & 2, Herlihy, Killarney, 2003 & 2007), but his music has not yet been comprehensively collected.",
"The OKeeffe fiddle and accordion manuscripts presented here below as scans have been kindly donated to ITMA by Paud Collins from Knockacur, Knocknagoshel, Co Kerry, a former accordion pupil of OKeeffes whose brothers Jer on fiddle and Dan on accordion were also pupils. The fiddle manuscripts are in Pdraig OKeeffes own hand, while the accordion manuscripts were copied for her brothers from OKeeffes originals by Paud Collinss sister Tess Drudy (who did not herself read the tablature).",
"The four sets of ITMA-Collins O'Keeffe facsimile manuscripts and the interactive music scores derived from them constitute the largest body of O'Keeffe's music that is publicly available.",
"With thanks to Paud Collins, and to his son Denis Collins who was instrumental in the making of the donation.",
"NC"], 
        "title": "Pdraig OKeeffe Manuscripts.  Book Three.  Accordion / transcribed by Tess Drudy",
        "short_title": "OKeeffe Accordion MS",
        "keywords" : "padraig o'keeffe okeeffe manuscript kerry sliabh luachra accordion" 

    },     
    {
        "author": "Pdraig OKeeffe", 
        "collector": "Pdraig OKeeffe", 
        "decade": "1950s", 
        "geolocation": {
            "lat": 52.20847, 
            "placename": "Glountane, Co. Kerry", 
            "lng": -9.33883000000003
        }, 
        "itma_collection_id": "padraig_okeeffe_ms_bk_4", 
        "itma_pub_order": 24, 
        "name": ["Pdraig OKeeffe"
        ], 
        "people": ["Pdraig OKeeffe"
        ], 
        "publication_date": "", 
        "publication_details": "", 
        "text": ["The famous Sliabh Luachra fiddle player and travelling fiddle-master Pdraig OKeeffe (18871963) from Glountane, near Castleisland, Co Kerry, at first followed in his fathers footsteps as the principal teacher in the local national school, but in 1920 abandoned conventional school-teaching for a more bohemian lifestyle.",
"He had inherited music from his OCallaghan mothers side of the family, and over the next four decades he taught hundreds of pupils fiddle especially and accordion and other instruments, moving in a wide circuit within striking distance of his home. An eccentric and notably witty character with a gift for musical variation, he left an indelible stamp on the music and folklore of the region, and is an example of how an individual musician may almost create a local music style.",
"In his teacher-training, OKeeffe would have learned the rudiments of staff notation and tonic solfa, but for his own teaching purposes he devised more intuitive tablature systems. For the fiddle he employed the four spaces of the music staff to correspond with the strings of the instrument, and with numerals indicating which fingers were to be pressed down. For the accordion he used numerals for the keys to be pressed and in- and out-symbols to indicate the direction of the bellows. Hundreds of the notations he left with pupils have been preserved in private hands, and two volumes of facsimiles have been published (Dan Herlihy, Sliabh Luachra Music Masters vols 1 & 2, Herlihy, Killarney, 2003 & 2007), but his music has not yet been comprehensively collected.",
"The OKeeffe fiddle and accordion manuscripts presented here below as scans have been kindly donated to ITMA by Paud Collins from Knockacur, Knocknagoshel, Co Kerry, a former accordion pupil of OKeeffes whose brothers Jer on fiddle and Dan on accordion were also pupils. The fiddle manuscripts are in Pdraig OKeeffes own hand, while the accordion manuscripts were copied for her brothers from OKeeffes originals by Paud Collinss sister Tess Drudy (who did not herself read the tablature).",
"The four sets of ITMA-Collins O'Keeffe facsimile manuscripts and the interactive music scores derived from them constitute the largest body of O'Keeffe's music that is publicly available.",
"With thanks to Paud Collins, and to his son Denis Collins who was instrumental in the making of the donation.",
"NC"], 
        "title": "Pdraig OKeeffe Manuscripts : miscellaneous pages.  Fiddle",
        "short_title": "O'Keeffe Misc. Fiddle MS",
        "keywords" : "padraig o'keeffe okeeffe manuscript kerry sliabh luachra fiddle"            
    },     
    {
        "author": "Alfred Perceval Graves", 
        "collector": "Honoria Galwey", 
        "decade": "1890s", 
        "geolocation": {
            "lat": 55.1890182, 
            "placename": "Moville, Co. Donegal", 
            "lng": -7.040053299999954
        }, 
        "itma_collection_id": "galwey_in_graves", 
        "itma_pub_order": 34, 
        "name": ["Honoria Galwey", "Alfred Perceval Graves", "Charles Wood"],
        "people": [
            "Honoria Galwey", "Alfred Perceval Graves", "Charles Wood"
        ], 
        "publication_date": "1897", 
        "publication_details": "London ; New York : Boosey & Co.", 
        "text": [
            "Arrangements, some through-composed, of tunes collected by Miss Honoria Galwey and arranged by Charles Wood, sometime professor of music in the University of Cambridge, which are available in facsimile via http://www.itma.ie/digitallibrary/book/irish-folk-songs. These arrangements are notationally and harmonically interesting, and are the most complex arrangements of traditional tunes which have been set by ITMA staff to date."
        ], 
        "title": "Miss Honoria Galwey in Graves Irish Folk-Songs",
        "short_title": "Galwey in Graves Irish Folk-Songs",
        "keywords" : "alfred perceval honoria galwey in graves irish folk-songs donegal moville piano" 

    }  
]